"""
Реалізуйте алгоритм пошуку номеру найпершого входження до заданого масиву, заданого числа x.
Якщо заданий елемент відсутній у списку - поверніть номер першого елементу, що більший за число x:
                            array[i] >= x
"""


def bsearch_leftmost(array, x):
    """ Бінарний пошук для відшукання найпершого входження заданого числа

    :param array: Відсортований за неспаданням масив цілих чисел
    :param x:     Шукане число
    :return:      Номер шуканого елемента у масиві
    """
    # TODO: реалізуйте алгоритм тут
    l, r = 0, len(array)
    counter = 0
    while l < r:
        m = l + (r - l) // 2
        if x > array[m]:
            l = m + 1
        else:
            r = m
    return l
